#+TITLE: Org Mode Note
#+hugo_base_dir: /home/awannaphasch2016/org/projects/sideprojects/website/my-website/hugo/quickstart

** how does org mode knows about context around a point/cursor?
=org-element-at-point= searches for context given a point in org file.
=org-element-at-point= does this by seaching for org element around point.
It returns ELEMENT in a form of (TYPE PROPS) where TYPE is defined in =org-element-all-elements= and PROPS is properties of that element.

Given that ELEMENT is alreayd obtained, one can get context of an ELEMENT directly using =org-element-context=. Please note that =org-element-at-point= is run when input to =org-element-context= is nil.

To get all list of ancestors of a given element, =org-element-lineage= can be used.
Input to org-element is a DATUM which can be supplied by =org-element-context=.

We can use context in various scenario.
For example, given that you want to know header argument of an org-block, you can get the information with the following code.
#+BEGIN_SRC emacs-lisp
(org-babel-get-src-block-info nil
                              (org-element-lineage
	                       (org-element-context)
	                       ;; Limit to supported contexts.
	                       '(babel-call clock dynamic-block footnote-definition
			                    footnote-reference inline-babel-call inline-src-block
			                    inlinetask item keyword node-property paragraph
			                    plain-list planning property-drawer radio-target
			                    src-block statistics-cookie table table-cell table-row
			                    timestamp)
	                       t))

#+END_SRC

#+RESULTS:
| emacs-lisp | (org-babel-get-src-block-info nil |

To execute the src block, context is passed to =org-babel-execute-src-block= to execute.
